In [1]:
1.data collection
2.data wrangling
3.data analyse
4.model building
5.deploying the model

SyntaxError: invalid syntax (<ipython-input-1-b6bbbef64b36>, line 1)

In [ ]:
tinyurl.com/preprocess-data

1.import necessary libraries
2.import the dataset
3.handle the missing values if any
4.seperate dependent and independent variables
5.encode the columns which are categorical
6.Feature scaling
7.splitting training and testing data

# 1.import necessary libraries

In [4]:
import numpy as np
import pandas as pd

# 2.import the dataset

In [5]:
#1.if your dataset is in your working directory
data=pd.read_csv("Data.csv")

In [6]:
#2.if your dataset is not in your present working directory
data=pd.read_csv(r"D:\SmartBridge\VIT\Data.csv")

In [7]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [9]:
data.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [10]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [11]:
data.tail()

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
data.shape

(10, 4)

In [13]:
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

# 3.handle the missing values if any

In [14]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

1.deleting rows with nans----1,0000...2 null values..then you can dlete the entire rows
2.deleting columns with nans   70 -80 % of my column contains null
3.replacing it with mean median and mode

In [16]:
data.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [17]:
data.isnull().any()

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

In [18]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [19]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [20]:
data['Age'].fillna(data['Age'].median(),inplace=True)

In [21]:
data['Salary'].fillna(data['Salary'].mean(),inplace=True)

In [22]:
data

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [23]:
data.isnull().any()

Country      False
Age          False
Salary       False
Purchased    False
dtype: bool

In [24]:
data.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

i numerical data is missing --use mena or median
if categorical data is missing ---use mode

## 4.seperate dependent and independent variables

In [26]:
data

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

dependent or output column---purchased---y
independent or in put columns ---country,age,salary----x

In [28]:
x=data.iloc[:,0:3]
x

   Country   Age        Salary
0   France  44.0  72000.000000
1    Spain  27.0  48000.000000
2  Germany  30.0  54000.000000
3    Spain  38.0  61000.000000
4  Germany  40.0  63777.777778
5   France  35.0  58000.000000
6    Spain  38.0  52000.000000
7   France  48.0  79000.000000
8  Germany  50.0  83000.000000
9   France  37.0  67000.000000

In [29]:
y=data.iloc[:,3:]
y

  Purchased
0        No
1       Yes
2        No
3        No
4       Yes
5       Yes
6        No
7       Yes
8        No
9       Yes

In [30]:
data["Country"].value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [31]:
data["Purchased"].value_counts()

No     5
Yes    5
Name: Purchased, dtype: int64

In [32]:
from collections import Counter as c
c(data["Country"])

Counter({'France': 4, 'Spain': 3, 'Germany': 3})

In [33]:
data1=data.copy()

# 5.encode the columns which are categorical

1/Label encoding
2.One hot encoding

Categorical variables--nominal CV
                        ordinal CV
1.nominal CV
 Gender
    male ,female    0,1 --------1,0
Country
 france germany spain  0 1 2 , 1 0 2 ,2 1 0
    
2.ordinal variables

education  salary grade

mtech     1
btech     2
intermediate  3
ssc 4

In [35]:
from sklearn.preprocessing import LabelEncoder

In [36]:
le=LabelEncoder()
print("before label encoding",c(data["Country"]))
data['Country']=le.fit_transform(data['Country'])
print("after label encoding",c(data["Country"]))

before label encoding Counter({'France': 4, 'Spain': 3, 'Germany': 3})
after label encoding Counter({0: 4, 2: 3, 1: 3})

In [37]:
data1

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [39]:
data1['Country']=data1['Country'].replace(['France','Spain','Germany'],
                                        ['0','1','2'])

In [40]:
data1['Country']

0    0
1    1
2    2
3    1
4    2
5    0
6    1
7    0
8    2
9    0
Name: Country, dtype: object

In [ ]:
#one hot encoding----nominal categorical variables
state  germany france spain
germany   1      0      0
france    0      1      0
spain     0      0      1


add more columns to you dataset 
How ?
3 categries---3-1=2 columns need to be added to the dataset
Country age salary purchased  France   spain
germany  23    3434   yes      0         0



if i have 100 categories==  100-1 99----curse of dimensionality

In [41]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [42]:
#name of the column transformer,the transform to apply,the column indices to apply to it
ct=ColumnTransformer([("one",OneHotEncoder(),[0])],remainder="passthrough")

In [43]:
x

   Country   Age        Salary
0   France  44.0  72000.000000
1    Spain  27.0  48000.000000
2  Germany  30.0  54000.000000
3    Spain  38.0  61000.000000
4  Germany  40.0  63777.777778
5   France  35.0  58000.000000
6    Spain  38.0  52000.000000
7   France  48.0  79000.000000
8  Germany  50.0  83000.000000
9   France  37.0  67000.000000

In [44]:
x.shape

(10, 3)

In [45]:
x=ct.fit_transform(x)
x

array([[1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 4.40000000e+01,
        7.20000000e+04],
       [0.00000000e+00, 0.00000000e+00, 1.00000000e+00, 2.70000000e+01,
        4.80000000e+04],
       [0.00000000e+00, 1.00000000e+00, 0.00000000e+00, 3.00000000e+01,
        5.40000000e+04],
       [0.00000000e+00, 0.00000000e+00, 1.00000000e+00, 3.80000000e+01,
        6.10000000e+04],
       [0.00000000e+00, 1.00000000e+00, 0.00000000e+00, 4.00000000e+01,
        6.37777778e+04],
       [1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 3.50000000e+01,
        5.80000000e+04],
       [0.00000000e+00, 0.00000000e+00, 1.00000000e+00, 3.80000000e+01,
        5.20000000e+04],
       [1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 4.80000000e+01,
        7.90000000e+04],
       [0.00000000e+00, 1.00000000e+00, 0.00000000e+00, 5.00000000e+01,
        8.30000000e+04],
       [1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 3.70000000e+01,
        6.70000000e+04]])

In [46]:
x.shape

(10, 5)

# 6.Feature scaling

In [ ]:
height   weight
cms         kgs

1.Standard Scaling   0,1
2.Min max scaling-1,1

In [47]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x=sc.fit_transform(x)
x

array([[ 1.22474487e+00, -6.54653671e-01, -6.54653671e-01,
         7.69734393e-01,  7.49473254e-01],
       [-8.16496581e-01, -6.54653671e-01,  1.52752523e+00,
        -1.69922498e+00, -1.43817841e+00],
       [-8.16496581e-01,  1.52752523e+00, -6.54653671e-01,
        -1.26352627e+00, -8.91265492e-01],
       [-8.16496581e-01, -6.54653671e-01,  1.52752523e+00,
        -1.01663033e-01, -2.53200424e-01],
       [-8.16496581e-01,  1.52752523e+00, -6.54653671e-01,
         1.88802776e-01,  6.63219199e-16],
       [ 1.22474487e+00, -6.54653671e-01, -6.54653671e-01,
        -5.37361746e-01, -5.26656882e-01],
       [-8.16496581e-01, -6.54653671e-01,  1.52752523e+00,
        -1.01663033e-01, -1.07356980e+00],
       [ 1.22474487e+00, -6.54653671e-01, -6.54653671e-01,
         1.35066601e+00,  1.38753832e+00],
       [-8.16496581e-01,  1.52752523e+00, -6.54653671e-01,
         1.64113182e+00,  1.75214693e+00],
       [ 1.22474487e+00, -6.54653671e-01, -6.54653671e-01,
        -2.46895937e-01,  2.93712492e-01]])

# 7.Splitting traing and testing data

In [ ]:
100 training   80
    testing    20

In [51]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

In [52]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(7, 5)
(3, 5)
(7, 1)
(3, 1)